Revit 2024 API
ConduitSizeSettings.GetSizeCount Method
 Gets the size count of the conduit size table. The conduit standard name the location of the size in the size table.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int GetSizeCount(
	string standardName
)
Visual Basic
Public Function GetSizeCount ( _
	standardName As String _
) As Integer
Visual C++
public:
int GetSizeCount(
	String^ standardName
)
Parameters
standardName
Type: System.String
 The conduit standard name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace